In [1]:
data = {
    "ID": range(1, 11),
    "Age": [25, 30, 35, np.nan, 45, 50, 29, 41, np.nan, 38],
    "Salary": [50000, 60000, 75000, 40000, 90000, 100000, 55000, 80000, 62000, np.nan],
    "Education": ["Bachelor", "Master", "PhD", "Bachelor", "Master", "PhD", "Bachelor", "Master", "PhD", "Bachelor"],
    "Work Experience": [2, 5, 7, 1, 10, 12, 3, 8, 6, np.nan],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Antonio", "San Diego", "Dallas", "San Jose"]
}

df = pd.DataFrame(data)

In [3]:
df

   ID   Age    Salary Education  Work Experience          City
0   1  25.0   50000.0  Bachelor              2.0      New York
1   2  30.0   60000.0    Master              5.0   Los Angeles
2   3  35.0   75000.0       PhD              7.0       Chicago
3   4   NaN   40000.0  Bachelor              1.0       Houston
4   5  45.0   90000.0    Master             10.0       Phoenix
5   6  50.0  100000.0       PhD             12.0  Philadelphia
6   7  29.0   55000.0  Bachelor              3.0   San Antonio
7   8  41.0   80000.0    Master              8.0     San Diego
8   9   NaN   62000.0       PhD              6.0        Dallas
9  10  38.0       NaN  Bachelor              NaN      San Jose


    "1. How many missing values are there in each column?",
    "2. How can we handle missing values in 'Age' and 'Salary' columns?",
    "3. Convert the 'Education' column into numerical values using one-hot encoding.",
    "4. Normalize the 'Salary' column using Min-Max Scaling.",
    "5. Create a new feature 'Experience Level' based on 'Work Experience' (e.g., Junior, Mid, Senior).",
    "6. Encode the 'City' column using label encoding.",
    "7. Generate an interaction feature between 'Age' and 'Work Experience'.",
    "8. Apply log transformation on the 'Salary' column to reduce skewness.",
    "9. Extract the first letter of each city name and create a new feature 'City Initial'.",
    "10. What insights can be drawn from the transformed dataset?"
]

In [4]:
df.describe()

             ID        Age         Salary  Work Experience
count  10.00000   8.000000       9.000000         9.000000
mean    5.50000  36.625000   68000.000000         6.000000
std     3.02765   8.534593   19615.045246         3.674235
min     1.00000  25.000000   40000.000000         1.000000
25%     3.25000  29.750000   55000.000000         3.000000
50%     5.50000  36.500000   62000.000000         6.000000
75%     7.75000  42.000000   80000.000000         8.000000
max    10.00000  50.000000  100000.000000        12.000000

In [21]:
count_na = df.isna().sum()
print("Here are the NA's from the data:\n", count_na)

Here are the NA's from the data:
 ID                 0
Age                2
Salary             1
Education          0
Work Experience    1
City               0
dtype: int64